homework/stjohnhospitalv2/app/views/hospitals/show.html.haml

SELECT `patients`.* FROM `patients`  WHERE `patients`.`hospital_id` = 9
---
%ul
  -@hospital.patients.each do |patient|