homework/stjohnhospitalv2/app/controllers/hospitals_controller.rb

  def index
    @hospitals = Hospital.all
---
SELECT `hospitals`.* FROM `hospitals`

	def create
	  @hospital = Hospital.create que_params
---
INSERT INTO `hospitals` (`created_at`, `name`, `updated_at`) VALUES ('2014-08-11 20:08:56', 'Grand Strand Regional Medical', '2014-08-11 20:08:56')

  def edit
    @hospital = Hospital.find params[:id]
---
SELECT  `hospitals`.* FROM `hospitals`  WHERE `hospitals`.`id` = 1 LIMIT 1

  def show
    @hospital = Hospital.find params[:id]
---
SELECT  `hospitals`.* FROM `hospitals`  WHERE `hospitals`.`id` = 10 LIMIT 1

  def update
    @hospital = Hospital.find params[:id]
    @hospital.update_attributes que_params
---
SELECT  `hospitals`.* FROM `hospitals`  WHERE `hospitals`.`id` = 1 LIMIT 1
UPDATE `hospitals` SET `name` = 'roper st. francis s', `updated_at` = '2014-08-12 13:22:55' WHERE `hospitals`.`id` = 8

  def destroy
    @hospital = Hospital.find params[:id]
    @hospital.delete
---
SELECT  `hospitals`.* FROM `hospitals`  WHERE `hospitals`.`id` = 1 LIMIT 1
DELETE FROM `hospitals` WHERE `hospitals`.`id` = 1

   def create_doctor
    @hospital = Hospital.find params[:id]
    @hospital.doctors.create doctor_params
---
SELECT  `hospitals`.* FROM `hospitals`  WHERE `hospitals`.`id` = 1 LIMIT 1
INSERT INTO `doctors` (`created_at`, `doctorable_id`, `doctorable_type`, `name`, `updated_at`) VALUES ('2014-08-13 04:46:04', 1, 'Hospital', 'dr jim', '2014-08-13 04:46:04')

  def delete_doctor
    @hospital = Hospital.find params[:id]
    @doctor = Doctor.find params[:doctor_id]
    @doctor.delete
---
SELECT  `hospitals`.* FROM `hospitals`  WHERE `hospitals`.`id` = 4 LIMIT 1
SELECT  `doctors`.* FROM `doctors`  WHERE `doctors`.`id` = 3 LIMIT 1
DELETE FROM `doctors` WHERE `doctors`.`id` = 3