homework/stjohnhospitalv2/app/controllers/medications_controller.rb

SELECT  `hospitals`.* FROM `hospitals`  WHERE `hospitals`.`id` = 17 LIMIT 1
SELECT  `patients`.* FROM `patients`  WHERE `patients`.`id` = 46 LIMIT 1
---
  def new
    @hospital = Hospital.find params[:hospital_id]
    @patient = Patient.find params[:patient_id]

SELECT `medications`.* FROM `medications`
---
  def index
    @medication = Medication.all

SELECT  `hospitals`.* FROM `hospitals`  WHERE `hospitals`.`id` = 9 LIMIT 1
SELECT  `patients`.* FROM `patients`  WHERE `patients`.`id` = 50 LIMIT 1
INSERT INTO `medications` (`created_at`, `name`, `patient_id`, `updated_at`) VALUES ('2014-08-12 19:34:51', 'rolaids', 46, '2014-08-12 19:34:51')
---
  def create
    @hospital = Hospital.find params[:hospital_id]
    @patient = Patient.find params[:patient_id]
    @medication = @patient.medications.new(que_params)
    if @medication.save == true

SELECT  `hospitals`.* FROM `hospitals`  WHERE `hospitals`.`id` = 9 LIMIT 1
SELECT  `patients`.* FROM `patients`  WHERE `patients`.`id` = 46 LIMIT 1
SELECT  `medications`.* FROM `medications`  WHERE `medications`.`id` = 3 LIMIT 1
---
  def edit
    @hospital = Hospital.find params[:hospital_id]
    @patient = Patient.find params[:patient_id]
    @medication = Medication.find params[:id]

SELECT  `hospitals`.* FROM `hospitals`  WHERE `hospitals`.`id` = 9 LIMIT 1
SELECT  `patients`.* FROM `patients`  WHERE `patients`.`id` = 46 LIMIT 1
SELECT  `medications`.* FROM `medications`  WHERE `medications`.`id` = 3 LIMIT 1
UPDATE `medications` SET `name` = 'xanax', `updated_at` = '2014-08-12 02:36:34' WHERE `medications`.`id` = 3
---
   def update
    @hospital = Hospital.find params[:hospital_id]
    @patient = Patient.find params[:patient_id]
    @medication = Medication.find params[:id]
    @medication.update_attributes que_params

SELECT  `hospitals`.* FROM `hospitals`  WHERE `hospitals`.`id` = 9 LIMIT 1
SELECT  `patients`.* FROM `patients`  WHERE `patients`.`id` = 46 LIMIT 1
SELECT  `medications`.* FROM `medications`  WHERE `medications`.`id` = 1 LIMIT 1
DELETE FROM `medications` WHERE `medications`.`id` = 1
---
   def destroy
    @hospital = Hospital.find params[:hospital_id]
    @patient = Patient.find params[:patient_id]
    @medication = Medication.find params[:id]
    @medication.delete