homework/stjohnhospitalv2/app/controllers/patients_controller.rb

SELECT  `patients`.* FROM `patients`  WHERE `patients`.`id` = 1 LIMIT 1
---
	def show
	  @patient = Patient.find params[:id]

INSERT INTO `patients` (`ailment`, `created_at`, `dob`, `firstName`, `gender`, `hospital_id`, `lastName`, `updated_at`, `workflow_state`) VALUES ('poops alot', '2014-08-12 15:55:00', '2014-08-12', 'bob', 'male', 9, 'bobson', '2014-08-12 15:55:00', 'waiting')
---
	def create
	  @patient = Patient.create que_params

SELECT  `patients`.* FROM `patients`  WHERE `patients`.`id` = 2 LIMIT 1
---
	def edit
	  @patient = Patient.find params[:id]

SELECT  `patients`.* FROM `patients`  WHERE `patients`.`id` = 2 LIMIT 1
UPDATE `patients` SET `ailment` = 'flu', `dob` = '1986-08-12', `firstName` = 'john', `lastName` = 'barlow', `updated_at` = '2014-08-12 16:56:03' WHERE `patients`.`id` = 45
---
	def update
		@patient = Patient.find params[:id]
		@patient.update_attributes que_params

SELECT  `patients`.* FROM `patients`  WHERE `patients`.`id` = 1 LIMIT 1
DELETE FROM `patients` WHERE `patients`.`id` = 1
---
	def destroy
		@patient = Patient.find params[:id]
		@patient.delete